wellrun/hc32f460/hc32f460_sdk/驱动库及样例/hc32f46x_ddl_v1.0.3/usb_lib/ctl_drv/usb_otg_regs.h
typedef union _USB_OTG_HPTXSTS_TypeDef
{
    uint32_t d32;
    struct
    {
        uint32_t ptxfspcavail :
            16;
        uint32_t ptxqspcavail :
            8;
        struct
        {
            uint32_t terminate :
                1;
            uint32_t token :
                2;
            uint32_t chnum :
                4;
            uint32_t odd_even :
                1;
        } ptxqtop;
    }
    b;
} USB_OTG_HPTXSTS_TypeDef ;

typedef union _USB_OTG_HPRT0_TypeDef
{
    uint32_t d32;
    struct
    {
        uint32_t prtconnsts :
            1;
        uint32_t prtconndet :
            1;
        uint32_t prtena :
            1;
        uint32_t prtenchng :
            1;
        uint32_t prtovrcurract :
            1;
        uint32_t prtovrcurrchng :
            1;
        uint32_t prtres :
            1;
        uint32_t prtsusp :
            1;
        uint32_t prtrst :
            1;
        uint32_t Reserved9 :
            1;
        uint32_t prtlnsts :
            2;
        uint32_t prtpwr :
            1;
        uint32_t prttstctl :
            4;
        uint32_t prtspd :
            2;
        uint32_t Reserved19_31 :
            13;
    }
    b;
} USB_OTG_HPRT0_TypeDef ;

typedef union _USB_OTG_HAINT_TypeDef
{
    uint32_t d32;
    struct
    {
        uint32_t chint :
            16;
        uint32_t Reserved :
            16;
    }
    b;
} USB_OTG_HAINT_TypeDef ;

typedef union _USB_OTG_HAINTMSK_TypeDef
{
    uint32_t d32;
    struct
    {
        uint32_t chint :
            16;
        uint32_t Reserved :
            16;
    }
    b;
} USB_OTG_HAINTMSK_TypeDef ;

typedef union _USB_OTG_HCCHAR_TypeDef
{
    uint32_t d32;
    struct
    {
        uint32_t mps :
            11;
        uint32_t epnum :
            4;
        uint32_t epdir :
            1;
        uint32_t Reserved :
            1;
        uint32_t lspddev :
            1;
        uint32_t eptype :
            2;
        uint32_t multicnt :
            2;
        uint32_t devaddr :
            7;
        uint32_t oddfrm :
            1;
        uint32_t chdis :
            1;
        uint32_t chen :
            1;
    }
    b;
} USB_OTG_HCCHAR_TypeDef ;

typedef union _USB_OTG_HCSPLT_TypeDef
{
    uint32_t d32;
    struct
    {
        uint32_t prtaddr :
            7;
        uint32_t hubaddr :
            7;
        uint32_t xactpos :
            2;
        uint32_t compsplt :
            1;
        uint32_t Reserved :
            14;
        uint32_t spltena :
            1;
    }
    b;
} USB_OTG_HCSPLT_TypeDef ;

typedef union _USB_OTG_HCINTn_TypeDef
{
    uint32_t d32;
    struct
    {
        uint32_t xfercompl :
            1;
        uint32_t chhltd :
            1;
        uint32_t ahberr :
            1;
        uint32_t stall :
            1;
        uint32_t nak :
            1;
        uint32_t ack :
            1;
        uint32_t nyet :
            1;
        uint32_t xacterr :
            1;
        uint32_t bblerr :
            1;
        uint32_t frmovrun :
            1;
        uint32_t datatglerr :
            1;
        uint32_t Reserved :
            21;
    }
    b;
} USB_OTG_HCINTn_TypeDef ;

typedef union _USB_OTG_HCTSIZn_TypeDef
{
    uint32_t d32;
    struct
    {
        uint32_t xfersize :
            19;
        uint32_t pktcnt :
            10;
        uint32_t pid :
            2;
        uint32_t dopng :
            1;
    }
    b;
} USB_OTG_HCTSIZn_TypeDef ;

typedef union _USB_OTG_HCINTMSK_TypeDef
{
    uint32_t d32;
    struct
    {
        uint32_t xfercompl :
            1;
        uint32_t chhltd :
            1;
        uint32_t ahberr :
            1;
        uint32_t stall :
            1;
        uint32_t nak :
            1;
        uint32_t ack :
            1;
        uint32_t nyet :
            1;
        uint32_t xacterr :
            1;
        uint32_t bblerr :
            1;
        uint32_t frmovrun :
            1;
        uint32_t datatglerr :
            1;
        uint32_t Reserved :
            21;
    }
    b;
} USB_OTG_HCINTMSK_TypeDef ;

typedef union _USB_OTG_PCGCCTL_TypeDef
{
    uint32_t d32;
    struct
    {
		/** Stop Pclk */
		unsigned stoppclk:1;
		/** Gate Hclk */
		unsigned gatehclk:1;
		/** Power Clamp */
		unsigned pwrclmp:1;
		/** Reset Power Down Modules */
		unsigned rstpdwnmodule:1;
		/** Reserved */
		unsigned reserved:1;
		/** Enable Sleep Clock Gating (Enbl_L1Gating) */
		unsigned enbl_sleep_gating:1;
		/** PHY In Sleep (PhySleep) */
		unsigned phy_in_sleep:1;
		/** Deep Sleep*/
		unsigned deep_sleep:1;
		unsigned resetaftsusp:1;
		unsigned restoremode:1;
		unsigned enbl_extnd_hiber:1;
		unsigned extnd_hiber_pwrclmp:1;
		unsigned extnd_hiber_switch:1;
		unsigned ess_reg_restored:1;
		unsigned prt_clk_sel:2;
		unsigned port_power:1;
		unsigned max_xcvrselect:2;
		unsigned max_termsel:1;
		unsigned mac_dev_addr:7;
		unsigned p2hd_dev_enum_spd:2;
		unsigned p2hd_prt_spd:2;
		unsigned if_dev_mode:1;
    }
    b;
} USB_OTG_PCGCCTL_TypeDef ;

/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
  Global function prototypes (definition in C source)
 ******************************************************************************/

#endif //__USB_OTG_REGS_H__

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/

